<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of RingCentral Meetings and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.RingCentralMeetings</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>us.zoom.ringcentral</string>
		<key>NAME</key>
		<string>RingCentral Meetings</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.RingCentralMeetings</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
