<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of RingCentral Meetings and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.munki.RingCentralMeetings</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/RingCentralMeetings</string>
      <key>NAME</key>
      <string>RingCentral Meetings</string>
      <key>pkginfo</key>
      <dict>
        <key>blocking_applications</key>
        <array>
          <string>RingCentral Meetings.app</string>
        </array>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>Online videoconferencing app for RingCentral.</string>
        <key>developer</key>
        <string>RingCentral</string>
        <key>display_name</key>
        <string>RingCentral Meetings</string>
        <key>minimum_os_version</key>
        <string>10.10</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.pkg.RingCentralMeetings</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>faux_root</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%</string>
          <key>installs_item_paths</key>
          <array>
            <string>/Applications/RingCentral Meetings.app</string>
          </array>
        </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
      </dict>
      <dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>additional_pkginfo</key>
          <dict>
            <key>version</key>
            <string>%version%</string>
            <key>receipts</key>
            <array>
              <dict>
                <key>packageid</key>
                <string>us.zoom.pkg.ringcentral</string>
                <key>version</key>
                <string>%version%</string>
              </dict>
            </array>
          </dict>
        </dict>
        <key>Processor</key>
        <string>MunkiPkginfoMerger</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
