<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TimeMachineEditor and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.TimeMachineEditor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TimeMachineEditor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.2</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.TimeMachineEditor</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
