<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generated with help from Recipe Robot v0.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SnapGene Viewer.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.SnapGeneViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SnapGene Viewer</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href=".+&amp;majorRelease=([\d\.]+)&amp;minorRelease=[\d\.]+&amp;os=mac"</string>
				<key>result_output_var_name</key>
				<string>majorversion</string>
				<key>url</key>
				<string>http://www.snapgene.com/products/snapgene_viewer/</string>
			</dict>
			<key>Comment</key>
			<string>Scrapes the "major" version number of the current SnapGene Viewer release.</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href=".+&amp;majorRelease=[\d\.]+&amp;minorRelease=([\d\.]+)&amp;os=mac"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>http://www.snapgene.com/products/snapgene_viewer/</string>
			</dict>
			<key>Comment</key>
			<string>Scrapes the full version number of the current SnapGene Viewer release.</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>http://www.snapgene.com//products/snapgene_viewer/download.php?&amp;majorRelease=%majorversion%&amp;minorRelease=%version%&amp;os=mac</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.gslbiotech.snapgeneviewer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = WVCV9Q8Y78</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
