<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Malwarebytes and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.Malwarebytes</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Malwarebytes</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Malwarebytes.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Defends Macs against malware, adware, and potentially unwanted programs.</string>
			<key>developer</key>
			<string>Malwarebytes</string>
			<key>display_name</key>
			<string>Malwarebytes</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.2</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.Malwarebytes</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>uninstall_script</key>
					<string>#!/bin/bash

launchctl unload "/Library/LaunchAgents/com.malwarebytes.mbam.frontend.agent.plist" &amp;&amp; rm -rf "/Library/LaunchAgents/com.malwarebytes.mbam.frontend.agent.plist"
launchctl unload "/Library/LaunchDaemons/com.malwarebytes.mbam.rtprotection.daemon.plist" &amp;&amp; rm -rf "/Library/LaunchDaemons/com.malwarebytes.mbam.rtprotection.daemon.plist"
launchctl unload "/Library/LaunchDaemons/com.malwarebytes.mbam.settings.daemon.plist" &amp;&amp; rm -rf "/Library/LaunchDaemons/com.malwarebytes.mbam.settings.daemon.plist"

kextunload "/Library/Extensions/com.malwarebytes.mbam.rtprotection.kext" &amp;&amp; rm -rf "/Library/Extensions/com.malwarebytes.mbam.rtprotection.kext"

rm -rf "/Applications/Malwarebytes.app"
rm -rf "/Library/Application Support/Malwarebytes/MBAM"
					</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
