<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download the latest CI/CD job artifact from the specified GitLab repository, and imports the pkg file at the artifact path into Munki. Can be used to automatically import MunkiPkg installer files built by CI/CD, for example. See the README.md file for details on using this recipe.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.GitLabArtifact</string>
	<key>Input</key>
	<dict>
		<key>ARTIFACT_PATH</key>
		<string>build/*.pkg</string>
		<key>DESCRIPTION</key>
		<string>A really great Foo that helps you Bar.</string>
		<key>DISPLAY_NAME</key>
		<string>GitLab Artifact Package</string>
		<key>GITLAB_HOSTNAME</key>
		<string>gitlab.example.com</string>
		<key>JOB_NAME</key>
		<string>munkipkg_building</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>gitlab_artifact</string>
		<key>PRIVATE_TOKEN</key>
		<string>PUT_TOKEN_IN_OVERRIDE</string>
		<key>URLENCODED_PROJECT</key>
		<string>owner%2frepository</string>
		<key>VIRUSTOTAL_AUTO_SUBMIT</key>
		<string>False</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>%DESCRIPTION%</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.GitLabArtifact</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%ARTIFACT_PATH%</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
