<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Egnyte Desktop Sync.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.EgnyteDesktopSync</string>
	<key>Input</key>
	<dict>
		<key>LOCALE</key>
		<string>en-us</string>
		<key>NAME</key>
		<string>Egnyte Desktop Sync</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"https?:\/\/egnyte-cdn\.egnyte\.com\/desktopsync\/mac\/%LOCALE%\/(?P&lt;version&gt;[\d\.]+)\/(?P&lt;download_file&gt;EgnyteDesktopSync_[\S]+\.pkg+)[\?"]</string>
				<key>url</key>
				<string>https://helpdesk.egnyte.com/hc/%LOCALE%/articles/201636844</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>EgnyteDesktopSync-%version%.pkg</string>
				<key>url</key>
				<string>https://egnyte-cdn.egnyte.com/desktopsync/mac/%LOCALE%/%version%/%download_file%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Egnyte Inc (FELUD555VC)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
