<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Egnyte Desktop Sync (already in pkg format).</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.EgnyteDesktopSync</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Egnyte Desktop Sync</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.EgnyteDesktopSync</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
