<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of ezeep Print App and imports it into Munki.

The ezeep "Blue" app is only for administrators of ezeep Blue. Details:
https://www.ezeep.com/downloads/ezeep-blue/

For the older "ezeep Desktop" app, use the ezeepDesktop recipes.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.ezeepBluePrintApp</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ezeep Print App</string>
		<key>pkg_ids_set_optional_true</key>
		<array>
			<string>com.thinprint.ezeep.printapp.logging</string>
			<string>com.thinprint.ezeep.printapp.printerdriver</string>
			<string>com.ThinPrint.TPAutoConnect.PPDGen</string>
			<string>com.ThinPrint.TPAutoConnect</string>
		</array>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>ezeep Print App.app</string>
				<string>LauncherApplication.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Centralized cloud printing software.</string>
			<key>developer</key>
			<string>ezeep</string>
			<key>display_name</key>
			<string>ezeep</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.ezeepBluePrintApp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%found_filename%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkginfo_repo_path</key>
				<string>%pkginfo_repo_path%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiOptionalReceiptEditor</string>
		</dict>
	</array>
</dict>
</plist>
