<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of TermHere.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.TermHere</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TermHere</string>
		<key>SPARKLE_FEED_URL</key>
		<string>https://cdn.hbang.ws/updates/termhere.xml</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_2) AppleWebKit/602.3.12 (KHTML, like Gecko) Version/10.0.2 Safari/602.3.12</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>appcast_url</key>
				<string>%SPARKLE_FEED_URL%</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>%2520</string>
				<key>input_string</key>
				<string>%url%</string>
				<key>replace</key>
				<string>%20</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>%USER_AGENT%</string>
				</dict>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/TermHere.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "ws.hbang.TermHere" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N2LN9ZT493)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
