<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of syntaqlite.

Tested values for ARCH include:
- arm64 (Apple Silicon, default)
- x64 (Intel)
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.syntaqlite</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>syntaqlite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>syntaqlite-macos-%ARCH%\.tar\.gz</string>
				<key>github_repo</key>
				<string>LalitMaganti/syntaqlite</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%ARCH%.tgz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
