<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Kiro.

Tested values for ARCH include:
- arm64 (default, Apple Silicon)
- x64 (Intel)
	</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Kiro</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>Kiro</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://prod\.download\.desktop\.kiro\.dev/releases/stable/darwin-%ARCH%/signed/[\d\.]+/kiro-ide-([\d\.]+)-stable-darwin-%ARCH%\.dmg</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://prod.download.desktop.kiro.dev/stable/metadata-dmg-darwin-%ARCH%-stable.json</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH%-%version%.dmg</string>
				<key>url</key>
				<string>https://prod.download.desktop.kiro.dev/releases/stable/darwin-%ARCH%/signed/%version%/kiro-ide-%version%-stable-darwin-%ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Kiro.app</string>
				<key>requirement</key>
				<string>identifier "dev.kiro.desktop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "94KV3E626L"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Kiro.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
