<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RapidWeaver and imports it into Munki.

The MAJOR_VERSION input variable can be overridden to determine which version of the app is retrieved. The only possible value as of this writing is 6 (default).</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.RapidWeaver</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>6</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/RapidWeaver</string>
		<key>NAME</key>
		<string>RapidWeaver</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Create template-based websites rapidly.</string>
			<key>developer</key>
			<string>Realmac Software</string>
			<key>display_name</key>
			<string>RapidWeaver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.RapidWeaver</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
