<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Smultron 7.

This recipe will be deprecated soon.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Smultron7</string>
	<key>Input</key>
	<dict>
        <key>MAJOR_VERSION</key>
		<string>7</string>
		<key>NAME</key>
		<string>Smultron</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
    <key>ParentRecipe</key>
	<string>com.github.homebysix.download.Smultron</string>
</dict>
</plist>
