<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the NDI OBS runtime via a mirror hosted by Palakis. Includes a check to ensure the downloaded package is signed by NewTek.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.PalakisNDIRuntime</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PalakisNDIRuntime</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>ndi-runtime-([\d\.]+)-macOS.pkg</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://ndi.palakis.fr/runtime/?C=M;O=D</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>NDIRuntime-%version%.pkg</string>
				<key>url</key>
				<string>https://ndi.palakis.fr/runtime/ndi-runtime-%version%-macOS.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: NewTek, Inc. (W8U66ET244)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
