<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Installs the latest version of cd to. The TERMINAL_APP variable determines which app cd to will work with. Its possible options are "terminal", "iterm", and "x11_xterm", and it is set to "terminal" by default.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.install.cdto</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>cd to</string>
        <key>APP_DESTINATION</key>
        <string>/Applications</string>
        <key>TERMINAL_APP</key>
        <string>terminal</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.pkg.cdto</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
