<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AJA Mini-Config.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.AJAMiniConfig</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AJA Mini-Config</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>assets\\/support\\/files\\/(?P&lt;fileid&gt;\d+)\\/en\\/Mini_Config_v(?P&lt;version&gt;[\d\.]+)_macOS\.zip</string>
                <key>url</key>
                <string>https://www.aja.com/products/mini-config-software#support</string>
                <key>result_output_var_name</key>
                <string>filepath</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
				<key>url</key>
				<string>https://www.aja.com/assets/support/files/%fileid%/en/Mini_Config_v%version%_macOS.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unzipped</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unzipped/Mini_Config_v%version%_macOS/AJA_Mini-Config-%version%.dmg/AJA Mini-Config.app</string>
				<key>requirement</key>
				<string>identifier "com.aja.MiniConfig" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9VB857J7CD"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
