<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Verifies your pre-downloaded Zend Studio download and prepares it for processing by child recipes.

Zend Studio can be downloaded here: https://www.zend.com/downloads/zend-studio
An email address is required to initiate the download.

Once you've downloaded, pass the resulting file in to this recipe using the PKG variable or -p flag:
    autopkg run -v ZendStudio.download -p ~/Downloads/ZendStudio-13.6.1-macosx.cocoa.x86_64.dmg</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.ZendStudio</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ZendStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%PKG%/Zend Studio.app</string>
				<key>requirement</key>
				<string>identifier "com.zend.php.ide" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y54R24CDV4</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%PKG%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
	</array>
</dict>
</plist>
