<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the major version of Parallels Desktop specified by MAJOR_VERSION. This recipe has been tested with major versions 10 through 18.

This recipe differs from the one in keeleysam-recipes because it offers code signature verification, does not require a ParallelsURLProvider processor, and also includes pkg and install recipes.

Input variable tips:
- For major versions 10 through 15 or 17 through 18, leave the PLATFORM_ARCH blank in your override.
- For major version 16, set the PLATFORM_ARCH in your override to either "intel" or "m1" depending on your desired architecture.
	<key>Identifier</key>
	<string>com.github.homebysix.install.ParallelsDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Parallels Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.ParallelsDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
