<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of GoToMeeting on the Mac running AutoPkg.
	
NOTE: This recipe does not utilize the preinstall cleanup script used by the pkg and munki recipes.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.GoToMeeting</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GoToMeeting</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.GoToMeeting</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>/Applications</string>
						<key>source_item</key>
						<string>GoToMeeting.app</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
