<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Eclipse.

Use the ARCHITECTURE input variable to specify whether you want to download the
Intel ("x86_64") or Apple Silicon ("aarch64") version of Eclipse.

Use the ECLIPSE_CODE input variable to specify the IDE version.
Eclipse IDE for C/C++ Developers: cpp
Eclipse IDE for Embedded C/C++ Developers: embedcpp
Eclipse IDE for Eclipse Committers: committers
Eclipse IDE for Java Developers: java
Eclipse IDE for Enterprise Java and Web Developers: jee
Eclipse IDE for Java and DSL Developers: dsl
Eclipse Modeling Tools: modeling
Eclipse IDE for PHP Developers: php
Eclipse IDE for RCP and RAP Developers: rcp
Eclipse IDE for Scientific Computing: parallel
Eclipse IDE for Scout Developers: scout</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Eclipse</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>x86_64</string>
		<key>ECLIPSE_CODE</key>
		<string>java</string>
		<key>NAME</key>
		<string>Eclipse</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\/downloads\/download\.php\?file=([/\w-]+eclipse-%ECLIPSE_CODE%[\w-]+macosx-cocoa-%ARCHITECTURE%\.dmg)</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11) AppleWebKit/601.1.39 (KHTML, like Gecko) Version/9.0 Safari/601.1.39</string>
				</dict>
				<key>result_output_var_name</key>
				<string>match</string>
				<key>url</key>
				<string>https://eclipse.org/downloads/eclipse-packages/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://eclipse.org/downloads/download.php?r=1&amp;file=%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "epp.package.%ECLIPSE_CODE%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JCDTMS22B4</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
