<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Eclipse.

Use the ARCHITECTURE input variable to specify whether you want to download the
Intel ("x86_64") or Apple Silicon ("aarch64") version of Eclipse.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Eclipse</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>x86_64</string>
		<key>NAME</key>
		<string>Eclipse</string>
		<key>SELECTION</key>
		<string>Eclipse IDE for Java Developers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>options</key>
				<dict>
					<key>Eclipse IDE for C/C++ Developers</key>
					<string>cpp</string>
					<key>Eclipse IDE for Embedded C/C++ Developers</key>
					<string>embedcpp</string>
					<key>Eclipse IDE for Eclipse Committers</key>
					<string>committers</string>
					<key>Eclipse IDE for Java Developers</key>
					<string>java</string>
					<key>Eclipse IDE for Enterprise Java and Web Developers</key>
					<string>jee</string>
					<key>Eclipse IDE for Java and DSL Developers</key>
					<string>dsl</string>
					<key>Eclipse Modeling Tools</key>
					<string>modeling</string>
					<key>Eclipse IDE for PHP Developers</key>
					<string>php</string>
					<key>Eclipse IDE for RCP and RAP Developers</key>
					<string>rcp</string>
					<key>Eclipse IDE for Scientific Computing</key>
					<string>parallel</string>
					<key>Eclipse IDE for Scout Developers</key>
					<string>scout</string>
				</dict>
				<key>result_output_var_name</key>
				<string>eclipse_code</string>
				<key>selection</key>
				<string>%SELECTION%</string>
			</dict>
			<key>Processor</key>
			<string>OptionSelector</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>\/downloads\/download\.php\?file=([/\w-]+eclipse-%eclipse_code%[\w-]+macosx-cocoa-%ARCHITECTURE%\.dmg)</string>
				<key>request_headers</key>
				<dict>
					<key>user-agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11) AppleWebKit/601.1.39 (KHTML, like Gecko) Version/9.0 Safari/601.1.39</string>
				</dict>
				<key>result_output_var_name</key>
				<string>match</string>
				<key>url</key>
				<string>https://eclipse.org/downloads/eclipse-packages/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://eclipse.org/downloads/download.php?r=1&amp;file=%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "epp.package.%eclipse_code%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JCDTMS22B4</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
