<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of A Better Finder Rename and imports it into Munki.

	The MAJOR_VERSION input variable can be overridden to determine which version of the app is retrieved. Possible values are 10 (default), 9, or 8.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.ABetterFinderRename</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>10</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/PublicSpace</string>
		<key>NAME</key>
		<string>A Better Finder Rename</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>File, photo, and MP3 batch renamer.</string>
			<key>developer</key>
			<string>Frank Reiff</string>
			<key>display_name</key>
			<string>A Better Finder Rename</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.ABetterFinderRename</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
