<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Ecosia.

NOTE: A Universal app appears to download regardless of ARCH value. Tested values for ARCH include:
- arm64 (default)
- x64
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Ecosia</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Ecosia Browser</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>Ecosia</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>LocationUri":"(https://app-cms-repo\.ecosia-browser\.net/[a-f0-9-]+/build/[\d\.]+/EcosiaBrowser-[\d\.]+\.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://ams.ecosia-browser.net/api/getLatest/144548e4-670e-46ef-be30-8d14ad305f19/mac/?update=false&amp;channelprofilename=PROD&amp;arch=%ARCH%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Ecosia Browser.app</string>
				<key>requirement</key>
				<string>identifier "org.ecosia.browser" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "33YMRSYD2L"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Ecosia Browser.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
