<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v0.2.6 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of DropDMG and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.DropDMG</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>DropDMG</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Quickly create disk image (dmg) archives.</string>
			<key>developer</key>
			<string>Michael Tsai</string>
			<key>display_name</key>
			<string>DropDMG</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Install DropDMG command line tool
CLI_SRC="/Applications/DropDMG.app/Contents/Frameworks/DropDMGFramework.framework/Versions/Current/dropdmg"
CLI_DST="/usr/local/bin/dropdmg"
if [[ -f $CLI_SRC ]]; then
    /bin/mkdir -pv "/usr/local/bin/"
    /bin/cp -v "$CLI_SRC" "$CLI_DST"
fi
exit 0
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
/bin/rm -f "/usr/local/bin/dropdmg"
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.DropDMG</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
