<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with some help from Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Hazel.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.Hazel</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Hazel</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.Hazel</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>/Library/PreferencePanes</string>
						<key>source_item</key>
						<string>%pathname%/Install Hazel.app/Contents/Resources/Hazel.prefPane</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
