<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest version of the ownCloud Desktop Client.

Set ARCH to "arm64" (default) or "x86_64" to target Apple Silicon or Intel respectively.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.ownCloudDesktopClient</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.ownCloudDesktopClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
