<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Emailchemy.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Emailchemy</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://s3.amazonaws.com/wksdownload/Emailchemy-Mac.dmg</string>
		<key>NAME</key>
		<string>Emailchemy</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Emailchemy.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.install4j.6029-5726-8846-0121.357" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5354MQYYTT")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Comment</key>
			<string>The Emailchemy app reports a code signature requirement of `always`, which is
			not strict enough to be useful with AutoPkg. Therefore the requirement argument above
			has been created manually to match Emailchemy's code signing more strictly as of
			December 2020.</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Emailchemy.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
