<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of nebula, creates a package, and installs the package on your AutoPkg Mac.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.nebula</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>nebula</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.nebula</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
