Description: Downloads the latest version of Gitfox.
Identifier: com.github.homebysix.download.Gitfox
Input:
  NAME: Gitfox
MinimumVersion: '2.3'
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: https://storage.googleapis.com/gitfox/Gitfox.latest.stable.zip
- Processor: EndOfCheckPhase
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Gitfox.app'
    requirement: anchor apple generic and identifier "com.bytieful.Gitfox" and (certificate
      leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6]
      /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists
      */ and certificate leaf[subject.OU] = MCZZULX74P)
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/Gitfox.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
