<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of the CrashPlan PROe client and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.pkg.CrashPlanPROeClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CrashPlan PROe Client</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.CrashPlanPROeClient</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/Install CrashPlanPROe.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/CrashPlanPROe-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
