<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Geometer's Sketchpad 5.

Not using CodeSignatureVerifier because version 5.06 resource envelope is obsolete (version 1 signature).</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.GSP5</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GSP5</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://sketchpad.keycurriculum.com/key-s3/gsp5/GSP5.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
