<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.4.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Markdown Prism.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.MarkdownPrism</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Markdown Prism</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>hulryung/markdown-prism</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/MarkdownPrism.app</string>
				<key>requirement</key>
				<string>identifier "com.markdownprism.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = XGJ87M8ZZR</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/MarkdownPrism.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
