<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of digikam.

Tested values for ARCH include:
- x86_64 (default, Intel)
- arm64 (Apple Silicon)
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.digiKam</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>NAME</key>
		<string>digiKam</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="([\d\.]+)/"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://download.kde.org/stable/digikam/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(digiKam-%version%-Qt\d-MacOS-%ARCH%.pkg)"</string>
				<key>result_output_var_name</key>
				<string>filename</string>
				<key>url</key>
				<string>https://download.kde.org/stable/digikam/8.8.0/?C=M;O=D</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.kde.org/stable/digikam/%version%/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
