<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Tor Browser Bundle.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.TorBrowserBundle</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>TorBrowserBundle</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?:(\d+\.(?:\d+\.)*\d+))/</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://dist.torproject.org/torbrowser/?C=M;O=D</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dist.torproject.org/torbrowser/%version%/TorBrowser-%version%-osx64_%LANGUAGE%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
