<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Tor Browser Bundle and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.munki.TorBrowserBundle</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TorBrowserBundle</string>
        <key>DISPLAY_NAME</key>
        <string>Tor Browser Bundle</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/TorBrowserBundle</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Web browser that anonymizes your activity using peer-to-peer networks.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>developer</key>
            <string>The Tor Project, Inc.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>installcheck_script</key>
            <string>#!/bin/bash
CURRENT_USER=$(/usr/bin/stat -f%Su /dev/console)
USER_APPS="/Users/$CURRENT_USER/Applications"
if [[ -d "$USER_APPS/TorBrowser.app" ]]; then
    exit 1
fi
exit 0
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.pkg.TorBrowserBundle</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
