<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Tor Messenger. Does not download pre-releases.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.TorMessenger</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>TorMessenger</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>"(https:\/\/dist\.torproject\.org\/tormessenger\/[\w\.]+/TorMessenger-[\w\.]+-osx64_%LANGUAGE%\.dmg)"</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>url</key>
				<string>https://trac.torproject.org/projects/tor/wiki/doc/TorMessenger#Downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
