<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v0.0.4 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of the Zoom Rooms (Mac) application to setup your conference room for one-touch meeting and calendar integration.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.ZoomPresence</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://zoom.us/client/latest/ZoomRooms.pkg</string>
		<key>NAME</key>
		<string>ZoomPresence</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Zoom Video Communications, Inc.</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
