<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Docker Desktop and imports it into Munki. See the download recipe description for information about using the PLATFORM_ARCH input variable to download the Intel/Apple Silicon version of Docker.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.DockerDesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Docker</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Automates deployment of containerized applications.</string>
			<key>developer</key>
			<string>Docker</string>
			<key>display_name</key>
			<string>Docker</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/zsh

currentUser="$(/usr/sbin/scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | /usr/bin/awk '/Name :/ { print $3 }')"

if	[ "${currentUser}" = "loginwindow" ]; then
	echo "No user logged in, skipping Docker setup."
	exit 1
else
	"/Applications/Docker.app/Contents/MacOS/install" --accept-license --user "${currentUser}"
fi
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/zsh

/bin/launchctl bootout system /Library/LaunchDaemons/com.docker.socket.plist
/bin/rm -f /Library/LaunchDaemons/com.docker.socket.plist
/bin/rm -f /private/var/run/docker.sock

/bin/rm -f /usr/local/bin/com.docker.cli
/bin/rm -f /usr/local/bin/docker
/bin/rm -f /usr/local/bin/docker-compose
/bin/rm -f /usr/local/bin/docker-compose-v1
/bin/rm -f /usr/local/bin/docker-credential-desktop
/bin/rm -f /usr/local/bin/docker-credential-ecr-login
/bin/rm -f /usr/local/bin/docker-credential-osxkeychain
/bin/rm -f /usr/local/bin/docker-index
/bin/rm -f /usr/local/bin/hub-tool
/bin/rm -f /usr/local/bin/kubectl
/bin/rm -f /usr/local/bin/kubectl-docker
/bin/rm -f /usr/local/bin/vpnkit

# These files are only installed if the user has tried to bind to a privileged port, they are not part of a default installation.
if [ -f /Library/LaunchDaemons/com.docker.vmnetd.plist ]; then
/bin/launchctl bootout system /Library/LaunchDaemons/com.docker.vmnetd.plist
/bin/rm -f /Library/LaunchDaemons/com.docker.vmnetd.plist
/bin/rm -f /Library/PrivilegedHelperTools/com.docker.vmnetd
fi
			</string>
			<key>preinstall_script</key>
			<string>#!/bin/zsh

currentUser="$(/usr/sbin/scutil &lt;&lt;&lt; "show State:/Users/ConsoleUser" | /usr/bin/awk '/Name :/ { print $3 }')"

if	[ "${currentUser}" = "loginwindow" ]; then
	echo "No user logged in, skipping Docker install."
	exit 1
fi
			</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.DockerDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
