<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Zscaler Mac app and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.Zscaler</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Zscaler</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Secure communications on your company Mac, even when you're not on the company network.</string>
			<key>developer</key>
			<string>Zscaler</string>
			<key>display_name</key>
			<string>Zscaler</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.zscaler</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
