<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Processes a downloaded ZBrush installer, creates a pkg, and imports it into Munki.

IMPORTANT: See the parent ZBrushVolume.pkg recipe description for important
information on running this recipe:
https://github.com/autopkg/jazzace-recipes/blob/master/Pixologic/ZBrushVolume.pkg.recipe
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.ZBrushVolume</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>ZBrush</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>ZBrush is a digital sculpting tool that combines 3D/2.5D modeling, texturing and painting.</string>
			<key>developer</key>
			<string>Pixologic</string>
			<key>display_name</key>
			<string>ZBrush</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.pkg.zbrushvolume</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
