<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot) and updated to use a downloaded pkg by jutonium.</string>
	<key>Description</key>
	<string>Downloads the latest version of Font Finagler as a package. This recipe is kept to maintain compatability.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.FontFinagler</string>
	<key>Input</key>
	<dict>
		<key>FILENAME</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Font Finagler</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.FontFinagler</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
