<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot) and updated to use a downloaded pkg by jutonium.</string>
	<key>Description</key>
	<string>Downloads the latest version of Font Finagler and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.FontFinagler</string>
	<key>Input</key>
	<dict>
		<key>FILENAME</key>
		<string>%NAME%</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Font Finagler</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Fixes garbled text font corruption.</string>
			<key>developer</key>
			<string>Mark Douma</string>
			<key>display_name</key>
			<string>Font Finagler</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.FontFinagler</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/bash
rm -rf "/Applications/Font Finagler.app"
rm -rf "/Library/LaunchDaemons/com.markdouma.finaglerd.plist"
rm -rf "/Library/PrivilegedHelperTools/com.markdouma.finaglerd"
rm -rf "/usr/local/bin/finagler"
rm -rf "/usr/local/share/man/man8/finagler.8"
pkgutil --forget "com.markdouma.pkg.FontFinagler"

exit
</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
