<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot) and updated to use a downloaded pkg by jutonium.</string>
	<key>Description</key>
	<string>Installs the latest version of Font Finagler.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.FontFinagler</string>
	<key>Input</key>
	<dict>
		<key>FILENAME</key>
		<string>%NAME%</string>
		<key>NAME</key>
		<string>Font Finagler</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.FontFinagler</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
