<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the Treasure Data "td-agent" disk image, which is a stable distribution package for the tdagent log collector (https://www.fluentd.org/faqs), and imports the package into Munki.

Acceptable values for PLATFORM_ARCH include:
- 'x86_64': Downloads the Intel version of Td-Agent. (This is the default.)
- 'arm64': Downloads the Apple Silicon version of Td-Agent.

NOTE: The Intel build will function with Rosetta2, but separate packaging is
ideal to support Apple Silicon Macs.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.fluentd-tdagent</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>tdagent</string>
		<key>PLATFORM_ARCH</key>
		<string>x86_64</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Fluentd is an open source data collector, and td-agent is a stable commercially supported agent for it.</string>
			<key>developer</key>
			<string>Treasure Data</string>
			<key>display_name</key>
			<string>Fluentd (td-agent)</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%PLATFORM_ARCH%</string>
			</array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.fluentd-tdagent</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
