<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of BlueJeans and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.BlueJeans</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>BlueJeans</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Blue Jeans.app/Contents/MacOS/Blue Jeans</string>
				<string>BlueJeans.app/Contents/MacOS/BlueJeans</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>BlueJeans video conferencing application.</string>
			<key>developer</key>
			<string>Blue Jeans Network</string>
			<key>display_name</key>
			<string>BlueJeans</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Install BlueJeans audio driver and privileged helper tool
HELPER_SRC="/Applications/BlueJeans.app/Contents/Library/LaunchServices/com.bluejeansnet.PrivilegedHelper"
HELPER_DST="/Library/PrivilegedHelperTools/com.bluejeansnet.PrivilegedHelper"
if [[ -f $HELPER_SRC ]]; then
    /bin/mkdir -pv "/Library/PrivilegedHelperTools/"
    /bin/cp -v "$HELPER_SRC" "$HELPER_DST"
fi
DRIVER_SRC="/Applications/BlueJeans.app/Contents/Resources/BlueJeans Audio.driver"
DRIVER_DST="/Library/Audio/Plug-Ins/HAL/BlueJeans Audio.driver"
if [[ -d $DRIVER_SRC ]]; then
    /bin/mkdir -pv "/Library/Audio/Plug-Ins/HAL/"
    /bin/cp -Rv "$DRIVER_SRC" "$DRIVER_DST"
fi
exit 0
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
/bin/rm -f "/Library/PrivilegedHelperTools/com.bluejeansnet.PrivilegedHelper"
/bin/rm -rf "/Library/Audio/Plug-Ins/HAL/BlueJeans Audio.driver"
</string>
			<key>preinstall_script</key>
			<string>#!/bin/bash
# Remove any existing 1.x version of "Blue Jeans.app"
/bin/rm -rf "/Applications/Blue Jeans.app"
</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.moofit-recipes.download.bluejeans</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Effective March 29, 2024, BlueJeans by Verizon has been sunset and is no longer supported. For details see https://www.bluejeans.com. This recipe will be removed in the future.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/BlueJeans.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--pkgvers</string>
					<string>%version%</string>
				</array>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
