<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Setup Manager and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.jamf-upload.JamfSetupManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>JamfSetupManager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.JamfSetupManager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_name</key>
				<string>%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
	</array>
</dict>
</plist>
