<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of cos (The Cosine CLI).

As of this writing, the only supported value for ARCH is "arm64".
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.cos</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>cos</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>version "v([0-9.]+)"</string>
				<key>url</key>
				<string>https://raw.githubusercontent.com/CosineAI/homebrew-tap/refs/heads/main/Formula/cos.rb</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-v%match%-%ARCH%.zip</string>
				<key>url</key>
				<string>https://software.cosine.sh/cli/release/v%match%/cos-darwin-%ARCH%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
