<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of CleanMyMac 3 beta.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.CleanMyMac3-beta</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CleanMyMac3beta</string>
        <key>DOWNLOAD_URL</key>
        <string>http://dl.devmate.com/com.macpaw.CleanMyMac3/beta/CleanMyMac3.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
