<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VyprVPN.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.VyprVPN</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VyprVPN</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>desktop/mac/production/(?P&lt;longversion&gt;[\d\.]+)/VyprVPN_v(?P&lt;shortversion&gt;[\d\.]+).dmg</string>
				<key>url</key>
				<string>https://www.vyprvpn.com/vpn-apps/vpn-for-mac</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>VyprVPN-%longversion%.dmg</string>
				<key>url</key>
				<string>https://www.vyprvpn.com/downloads/vyprvpn/desktop/mac/production/%longversion%/VyprVPN_v%shortversion%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/VyprVPN.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.goldenfrog.vyprvpn.mac" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6F2BA92582")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/VyprVPN.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
