<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sketch and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.Sketch</string>
    <key>ParentRecipe</key>
	<string>com.github.foigus.munki.Sketch</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
