<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Bartender and creates a package.
	
Specify which major version you want in the MAJOR_VERSION input variable. Supported values are 3 or 4.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.Bartender</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>4</string>
		<key>NAME</key>
		<string>Bartender</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.3</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.Bartender</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Bartender %MAJOR_VERSION%.app</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
