<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of a particular MAJOR_VERSION of Cocktail.

MAJOR_VERSION should correspond to a macOS release version. Supported values include:
- 14 for Sonoma (default)
- 13 for Ventura
- 12 for Monterey
- 11 for Big Sur
- 10.15 for Catalina
- 10.14 for Mojave
- 10.13 for High Sierra
- 10.12 for Sierra
- 10.11 for El Capitan
- 10.10 for Yosemite

This recipe does not support older major versions than Yosemite.
	</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Cocktail</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>14</string>
		<key>NAME</key>
		<string>Cocktail</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>CocktailReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Cocktail.app</string>
				<key>requirement</key>
				<string>identifier "%bundle_id%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "%cert_leaf_ou%"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Cocktail.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
