<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of Cocktail (for Yosemite).</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Cocktail-10.10</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>10.10</string>
		<key>NAME</key>
		<string>Cocktail</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Legacy Cocktail recipes for 10.10 through 10.15 are deprecated and will be removed. If you still require this recipe, consider switching to the new recipes based on Cocktail.download and overriding MAJOR_VERSION to "10.10".</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>CocktailReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Cocktail.app</string>
				<key>requirement</key>
				<string>identifier "%bundle_id%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "%cert_leaf_ou%"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
