<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Paparazzi!.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Paparazzi</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Paparazzi</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>class="version"&gt;([\d\.b]+)&lt;/span&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://derailer.org/paparazzi/downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(downloads/Paparazzi!%20%version%.dmg)"&gt;</string>
				<key>result_output_var_name</key>
				<string>urlpath</string>
				<key>url</key>
				<string>https://derailer.org/paparazzi/downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>https://derailer.org/paparazzi/%urlpath%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Paparazzi!.app</string>
				<key>requirement</key>
				<string>identifier "org.derailer.Paparazzi" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M72QZ9W58G</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
