<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Paparazzi! and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.munki.Paparazzi</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Paparazzi</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Tool for capturing screenshots of websites to image or PDF format.</string>
			<key>developer</key>
			<string>Nate Weaver</string>
			<key>display_name</key>
			<string>Paparazzi</string>
			<key>minimum_os_version</key>
			<string>10.9</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/zsh

# Command line tool source and destination paths.
CMD_TOOL_SRC="/Applications/Paparazzi!.app/Contents/Helpers/pzi"
CMD_TOOL_DST="/usr/local/bin"

if [[ -d "$CMD_TOOL_DST" ]]; then
    # Remove old tool, if it exists.
    rm -f "$CMD_TOOL_DST/pzi"
else
    # Create destination folder, if it doesn't exist.
    mkdir -p "$CMD_TOOL_DST"
fi

cp "$CMD_TOOL_SRC" "$CMD_TOOL_DST/pzi"
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/zsh
rm -f "/usr/local/bin/pzi"
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.Paparazzi</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
