<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)
	Code signature verification not possible. Code object not signed. No https download link available either.</string>
	<key>Description</key>
	<string>Downloads the latest version of UnRarX.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.UnRarX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UnRarX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
        	<dict>
            		<key>Processor</key>
            		<string>URLTextSearcher</string>
            		<key>Arguments</key>
            			<dict>
                			<key>url</key>
                			<string>http://www.unrarx.com/</string>
                			<key>re_pattern</key>
                			<string>(?P&lt;url&gt;http:\/\/www\.unrarx\.com\/files\/UnRarX_(?P&lt;version&gt;.*?)\.zip)</string>
            			</dict>
            	</dict>
        	<dict>
            		<key>Processor</key>
            		<string>URLDownloader</string>
            		<key>Arguments</key>
            			<dict>
               				<key>url</key>
               				<string>%url%</string>
               				<key>filename</key>
               				<string>%NAME%-%version%.zip</string>
            			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
