<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with help from Recipe Robot v1.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of UnRarX.

NOTE: As of 2016-09-21, code signature verification not possible. No HTTPS download link available either.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.UnRarX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UnRarX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>http:\/\/www\.unrarx\.com\/files\/UnRarX_([\d\.]+)\.zip</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>http://www.unrarx.com/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
				<key>url</key>
				<string>http://www.unrarx.com/files/UnRarX_%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
