<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Sequel Pro and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.SequelPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sequel Pro</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.SequelPro.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Sequel Pro is no longer under active development (details: https://github.com/sequelpro/sequelpro/issues/3705). This recipe may be removed in the future.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
