<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of ADPassMon.

ADPassMon is no longer maintained. Please consider using NoMAD instead.
https://macmule.com/2017/04/01/adpassmon-is-dead-long-live-nomad/
    </string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.ADPassMon</string>
    <key>Input</key>
    <dict>
        <key>GITHUB_REPO</key>
        <string>macmule/ADPassMon</string>
        <key>NAME</key>
        <string>ADPassMon</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>ADPassMon is no longer maintained. Please consider using NoMAD instead. https://macmule.com/2017/04/01/adpassmon-is-dead-long-live-nomad/</string>
            </dict>
        </dict>
        <dict>   
            <key>Processor</key>   
            <string>StopProcessingIf</string>   
            <key>Arguments</key>   
            <dict>   
                <key>predicate</key>   
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>%GITHUB_REPO%</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
