<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of AirServer</string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.AirServer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AirServer</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.airserver.com/download/mac/latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/AirServer.app</string>
                <key>requirement</key>
                <string>anchor apple generic and certificate leaf[subject.OU] = "6C755KS5W3"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
