<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of kubectl.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.kubectl</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>kubectl</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>v(\S+)</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://storage.googleapis.com/kubernetes-release/release/stable.txt</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://storage.googleapis.com/kubernetes-release/release/v%version%/bin/darwin/amd64/kubectl</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
