<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.3.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of QR Factory.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.QRFactory</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>QR Factory</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://tunabellysoftware.com/resources/sparkle/qrfactory.xml</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>%2520</string>
				<key>input_string</key>
				<string>%url%</string>
				<key>replace</key>
				<string>%20</string>
			</dict>
			<key>Comment</key>
			<string>The QR Factory Sparkle feed contains a double-encoded download URL, so we must manually fix the spaces here.</string>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/QR Factory.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.tunabellysoftware.qrfactory" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9525X5D6XV")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
