<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Attempts to build a deployable package file from the Box Sync installer app.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.pkg.BoxSync</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Box Sync</string>
        <key>BUNDLE_ID</key>
        <string>com.box.sync</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.boxsync</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                    <key>Library</key>
                    <string>0775</string>
                    <key>Library/PrivilegedHelperTools</key>
                    <string>0775</string>
                    <key>tmp</key>
                    <string>0777</string>
                    <key>tmp/BoxSyncInstall</key>
                    <string>0775</string>
                    <key>tmp/BoxSyncInstall/Library</key>
                    <string>0775</string>
                    <key>tmp/BoxSyncInstall/Library/Application Support</key>
                    <string>0775</string>
                    <key>tmp/BoxSyncInstall/Library/Application Support/Box</key>
                    <string>0775</string>
                    <key>tmp/BoxSyncInstall/Library/Application Support/Box/Box Sync</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/%NAME%.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkgroot%/Applications/%NAME%.app/Contents/Resources/cacert.pem</string>
                <key>destination_path</key>
                <string>%pkgroot%/tmp/BoxSyncInstall/Library/Application Support/Box/Box Sync/cacert.pem</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkgroot%/Applications/%NAME%.app/Contents/Resources/FinderPlugin.bundle</string>
                <key>destination_path</key>
                <string>%pkgroot%/tmp/BoxSyncInstall/Library/Application Support/Box/Box Sync/FinderPlugin.bundle</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkgroot%/Applications/%NAME%.app/Contents/Resources/com.box.sync.bootstrapper</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/PrivilegedHelperTools/com.box.sync.bootstrapper</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pkgroot%/Applications/%NAME%.app/Contents/Resources/com.box.sync.iconhelper</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/PrivilegedHelperTools/com.box.sync.iconhelper</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pkgroot%/Applications/%NAME%.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%BUNDLE_ID%</string>
                    <key>scripts</key>
                    <string>Scripts</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
