<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of GitHub Desktop.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.GitHubDesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GitHub Desktop</string>
        <key>FILENAME</key>
        <string>GitHubDesktop</string>
        <key>URL</key>
        <string>https://central.github.com/mac/latest</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%FILENAME%.zip</string>
                <key>url</key>
                <string>%URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
