<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the GitHub command line tool.

Valid options for ARCH input variable are "amd64" for Intel (defualt) or "arm64" for Apple Silicon.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.GitHubCLI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GitHub CLI</string>
		<key>ARCH</key>
		<string>amd64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>gh_[\d\.]+_macOS_%ARCH%\.zip</string>
				<key>github_repo</key>
				<string>cli/cli</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
