<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v0.0.6 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest test build of NetSurf.

WARNING: The test builds of NetSurf can be unstable. Better to use the regular NetSurf recipe if you want a stable version.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.NetSurf-testbuild</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NetSurf</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(NetSurf-i686-apple-darwin10-gcc-jsoff-[\d]+.dmg)</string>
				<key>result_output_var_name</key>
				<string>download_filename</string>
				<key>url</key>
				<string>http://ci.netsurf-browser.org/builds/cocoa/LATEST</string>
			</dict>
			<key>Processor</key>
			<string>CURLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://ci.netsurf-browser.org/builds/cocoa/%download_filename%</string>
			</dict>
			<key>Processor</key>
			<string>CURLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
