<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MenuMeters and builds a package. This recipe differs from the one in jleggat-recipes because it performs code signature verification and installs MenuMeters.prefPane to /Library/PreferencePanes.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.MenuMeters</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>name.tuley.jay.MenuMeters</string>
		<key>NAME</key>
		<string>MenuMeters</string>
		<key>TERMINAL_APP</key>
		<string>terminal</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.MenuMeters</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Library/PreferencePanes/%NAME%.prefPane</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/MenuMeters Installer.app/Contents/Resources/%NAME%.prefPane</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>Library/PreferencePanes</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
