<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MenuMeters and imports it into Munki. This recipe differs from the one in jleggat-recipes because it performs code signature verification and installs MenuMeters.prefPane to /Library/PreferencePanes.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.munki.MenuMeters</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MenuMeters</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/MenuMeters</string>
        <key>TERMINAL_APP</key>
        <string>terminal</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>An app that opens a Terminal window to the current Finder path. Drag it into your active Finder window's toolbar for one-click access.</string>
            <key>display_name</key>
            <string>MenuMeters</string>
            <key>developer</key>
            <string>Jay Tuley</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.pkg.MenuMeters</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pkg_path%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Library</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
