<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kite.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.Kite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kite</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
<dict>
    <key>Processor</key>
    <string>DeprecationWarning</string>
    <key>Arguments</key>
    <dict>
        <key>warning_message</key>
        <string>Kite development ceased in 2022. (Details: https://web.archive.org/web/20241210091357/https://www.kite.com/blog/product/kite-is-saying-farewell/)
		
This recipe is deprecated and will be removed in the future.</string>
    </dict>
</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://release.kite.com/appcast.xml</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Kite.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.kite.Kite" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = A92TXSM8EL)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
