<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Adobe Experience Manager Desktop.
	
As of December 2020, AEM requires logging in to an Adobe ID in order to download.
Therefore, this recipe now requires you to specify the path to your downloaded AEM disk image 
using the `-p` flag.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.AdobeExperienceManagerDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Experience Manager Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.AdobeExperienceManagerDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%PKG%</string>
				<key>items_to_copy</key>
				<array>
					<dict>
						<key>destination_path</key>
						<string>/Applications</string>
						<key>source_item</key>
						<string>Adobe Experience Manager Desktop.app</string>
					</dict>
				</array>
			</dict>
			<key>Processor</key>
			<string>InstallFromDMG</string>
		</dict>
	</array>
</dict>
</plist>
