<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Experience Manager Desktop.

As of December 2020, AEM requires logging in to an Adobe ID in order to download.
Therefore, this recipe now requires you to specify the path to your downloaded AEM disk image
using the `-p` flag.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.AdobeExperienceManagerDesktop</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Experience Manager Desktop</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>PackageRequired</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%PKG%/Adobe Experience Manager Desktop.app</string>
				<key>requirement</key>
				<string>anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>Comment</key>
				<string>Overwrite the version we scraped from the Adobe support page, as it isn't accurate enough for some recipe types.</string>
				<key>input_plist_path</key>
				<string>%PKG%/Adobe Experience Manager Desktop.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
