<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Adobe Remote Update Manager command line tool and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.AdobeRemoteUpdateManager</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.adobe.PDApp.Enterprise.RemoteUpdateManager</string>
		<key>NAME</key>
		<string>AdobeRemoteUpdateManager</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.AdobeRemoteUpdateManager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Applications/Utilities</key>
					<string>0775</string>
					<key>Applications/Utilities/Adobe Application Manager</key>
					<string>0775</string>
					<key>Applications/Utilities/Adobe Application Manager/CCP</key>
					<string>0775</string>
					<key>Applications/Utilities/Adobe Application Manager/CCP/utilities</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/RemoteUpdateManager_mac/RemoteUpdateManager</string>
				<key>target</key>
				<string>%pkgroot%/Applications/Utilities/Adobe Application Manager/CCP/utilities/RemoteUpdateManager</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
							<key>path</key>
							<string>Applications/Utilities/Adobe Application Manager/CCP/utilities</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%pkgroot%</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
