<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Adobe Remote Update Manager command line tool.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.AdobeRemoteUpdateManager</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://s3.amazonaws.com/deploymenttools-prod/RemoteUpdateManager_mac.zip</string>
		<key>NAME</key>
		<string>AdobeRemoteUpdateManager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/RemoteUpdateManager_mac/RemoteUpdateManager</string>
				<key>requirement</key>
				<string>identifier "com.adobe.PDApp.Enterprise.RemoteUpdateManager" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_file_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/RemoteUpdateManager_mac/RemoteUpdateManager</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.BinaryFileVersioner/BinaryFileVersioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>split_on</key>
				<string>,</string>
			</dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
		</dict>
	</array>
</dict>
</plist>
