<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Skala Color.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.install.SkalaColor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SkalaColor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.pkg.SkalaColor</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
