<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Skala Color and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.SkalaColor</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.bjango.SkalaColor</string>
		<key>NAME</key>
		<string>SkalaColor</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.SkalaColor</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
					<key>Library</key>
                    <string>0775</string>
                    <key>Library/ColorPickers</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/Skala Color Installer.app/Contents/Resources/%NAME%.colorPicker</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Library/ColorPickers/%NAME%.colorPicker</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/unpacked</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Library/ColorPickers</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
					<key>id</key>
					<string>%BUNDLE_ID%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
