<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of apfel, an on-device Apple Intelligence CLI and OpenAI-compatible server.

As of this writing, the only supported value for ARCH is "arm64".

Security note: apfel release binaries are ad-hoc signed (no Developer ID / Team ID). This recipe intentionally omits CodeSignatureVerifier because there is no vendor signature to verify. Downstream administrators should weigh this before deploying.
</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.apfel</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>apfel</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*-%ARCH%-macos\.tar\.gz$</string>
				<key>github_repo</key>
				<string>Arthur-Ficial/apfel</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%ARCH%.tar.gz</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
