<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Richard Glaser's GNU bash installer and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.pkg.GNUBash</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GNUBash</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.homebysix.download.GNUBash</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            
<!-- Looking for help parsing the version of the flat pkg here. I'm doing this wrong...
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg/*.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg-unpacked/*.pkg</string>
                <key>skip_payload</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/pkg-unpacked/*.pkg/PackageInfo</string>
                <key>plist_version_key</key>
                <string>???</string>
            </dict>
        </dict>
-->

        </dict>
    </array>
</dict>
</plist>