<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of ApacheDirectoryStudio.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.ApacheDirectoryStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ApacheDirectoryStudio</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>&lt;a href=.*\"&gt;(.*)/&lt;/a</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://archive.apache.org/dist/directory/studio/?C=M;O=D</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://archive.apache.org/dist/directory/studio/%version%/ApacheDirectoryStudio-%version%-macosx.cocoa.x86_64.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/ApacheDirectoryStudio.app</string>
                <key>requirement</key>
                <string>identifier "org.apache.directory.studio.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2GLGAFWEQD"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>