<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Apache Directory Studio.</string>
    <key>Identifier</key>
    <string>com.github.homebysix.download.ApacheDirectoryStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Apache Directory Studio</string>
        <key>LANGUAGE</key>
        <string>en-US</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://dist.apache.org/repos/dist/release/directory/studio/</string>
				<key>re_pattern</key>
				<string>&lt;a href="([\d]+\..+)/"&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dist.apache.org/repos/dist/release/directory/studio/%version%/ApacheDirectoryStudio-%version%-macosx.cocoa.x86_64.tar.gz</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
