<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of VirtualBox

To download Apple Silicon use: "macOSArm64" in the DOWNLOAD_ARCH variable
To download Intel use: "OSX" in the DOWNLOAD_ARCH variable</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.VirtualBox</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VirtualBox</string>
		<key>DOWNLOAD_ARCH</key>
		<string>OSX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>comment</key>
				<string>Example: https://download.virtualbox.org/virtualbox/4.3.10/VirtualBox-4.3.10-93012-OSX.dmg</string>
				<key>re_pattern</key>
				<string>https://download\.virtualbox\.org/virtualbox/.*?/VirtualBox-.*?-%DOWNLOAD_ARCH%.dmg</string>
				<key>url</key>
				<string>https://www.virtualbox.org/wiki/Downloads</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Oracle America, Inc. (VB5E2TV963)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/VirtualBox.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
