<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cyberduck and builds a pkg, installs it.</string>
	<key>Identifier</key>
	<string>com.github.autopkg.homebysix.install.Cyberduck</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Cyberduck</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>Please switch to new identifier "com.github.homebysix.install.Cyberduck" instead of "com.github.autopkg.homebysix.install.Cyberduck".</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
		</dict>
	</array>
</dict>
</plist>
