<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Chef Workstation for Mac version.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.download.ChefWorkstation</string>
	<key>Input</key>
	<dict>
		<key>CHEF_VERSION</key>
		<string>latest</string>
		<key>NAME</key>
		<string>ChefWorkstation</string>
		<key>OS</key>
		<string>11</string>
		<key>URL</key>
		<string>https://omnitruck.chef.io/stable/chef-workstation/download?p=mac_os_x&amp;pv=%OS%&amp;m=x86_64&amp;v=%CHEF_VERSION%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Chef Software, Inc. (EU3VF8YLX2)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%/chef*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
