<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GraphicConverter 9 and creates a package.

NOTE: This recipe is deprecated and will be removed in the future. Please use the new recipe with identifier "com.github.homebysix.pkg.GraphicConverter", which is located in the same folder as this one. The new recipe has a MAJOR_VERSION variable that can be overridden to select either version 10 (default) or version 9.

This recipe has been converted into a recipe override for the new download recipe with MAJOR_VERSION 9 specified. Feel free to copy this file into your RecipeOverrides folder and use it indefinitely.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.GraphicConverter9</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>9</string>
		<key>NAME</key>
		<string>GraphicConverter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.GraphicConverter</string>
</dict>
</plist>
